Repository: Magnum3D/MagnumFlasher
Catalog: lang.po
Languages: ru

source: Select firmware
ru: Выберите прошивку

source: Refresh
ru: Обновить

source: Press Refresh...
ru: Нажмите Обновить

source: Flash now
ru: Прошить

source: Close
ru: Закрыть

source: File...
ru: Прошить файл

source: Click Boot button on printer during flashing!
ru: Нажмите на кнопку Boot на принтере во время прошивки!

source: More info
ru: Описание

source: %s %s Downloads: %i %s
ru: %s %s Скачано: %i %s

source: Downloading releases...
ru: Скачиваю список прошивок

source: Error requesting %s: %i %s
ru: Ошибка запроса %s: %i %s

source: Found %i firmware releases
ru: Найдено прошивок: %i

source: Open firmware file
ru: Выбрать файл с прошивкой

source: Flash %s???
ru: Прошить %s???

source: Confirm
ru: Подтвердить

source: Flashing %s
ru: Прошиваю %s

source: Execution of '%s' failed.
ru: Выполнить '%s' не удалось.

source: Process launched (%ld): '%s'
ru: Процесс запущен (%ld): '%s'

source: Process %ld (%s) launched.
ru: Процесс %ld (%s) запущен.

source: Downloading %s
ru: Скачиваю %s

source: Failed to download %s
ru: Не удалось скачать %s

source: Finished with err code: %i
ru: Закончено с ошибкой: %i

source: Download && flash %s???
ru: Скачать прошивку %s и прошить в принтер?

source: Magnum3D firmware flasher
ru: Обновление прошивки для 3D-принтеров Magnum3D
